<template>
  <div>
    <h1 class="page-title">Privacy policy</h1>
    <section>
      <h3 class="page-sub-title">情報セキュリティに関する方針</h3>
      <div class="px-4 sm:px-8">
        <p>株式会社アンヴィルは、お客様にとって特別なものを創ることを社是とし、当社の製品及び、サービスに係るすべての人々からの信頼と安心を寄せられる会社でありたいと考え、お客様より頂いた情報及び当社の情報に対して以下の方針において情報保護に努める事を宣言します。</p>
        <h4>行動指針</h4>
        <ol>
          <li>情報資産の機密性、完全性、可用性を確実に保護するために組織的、技術的に適切な対策を講じ、変化する情報技術や新たな脅威に対応します。</li>
          <li>全社員に情報セキュリティ教育の実施と方針の周知徹底をはかり、意識の向上・維持に務めます。</li>
          <li>情報セキュリティについて、その関連する法令及びその他社会的規範を遵守します。</li>
          <li>万一情報セキュリティに問題が生じたとしても、その被害を最小限に抑え、迅速に原因究明を行い再発防止に努めます。</li>
          <li>マネジメントシステム及び、情報セキュリティに関する目的を設定し、定期的にレビューすることで、継続的に改善を実施し、維持します。</li>
        </ol>
        <h4>情報セキュリティ体制</h4>
        <p>株式会社アンヴィルのセキュリティ体制は情報セキュリティの専門部署である「セキュリティ対策室」と、同部署が主催及び招集を行うセキュリティ委員会で構成されています</p>
        <p>セキュリティ対策室はCISO(情報セキュリティ統轄役員)のもと設置され、同部署はセキュリティの現状の把握、収集、分析を行い、セキュリティの見直し及び改善の為の企画を行います。またCSIRT(セキュリティインシデント対応組織)を兼ね、有事の際の対応を行います。</p>
        <p>セキュリティ委員会は定期もしくは必要に応じて臨時でセキュリティ対策室のもと開催されます。同会議におけるセキュリティ対策室以外の参加者は各部署の課長級以上で構成されます。同会議では各部署のセキュリティ状況の把握、及びセキュリティに関する規約等の採決を行い、参加者は自部署に対して決定事項の共有及び実施を行います。</p>
        <p>株式会社アンヴィルは上記の組織体制のもと、全部署がセキュリティに関与し、積極的にセキュリティの維持及び向上に努めていきます。</p>
      </div>
    </section>
    <section>
      <h3 class="page-sub-title">個人情報取り扱いに関する方針</h3>
      <div class="px-4 sm:px-8">
        <ol>
          <li>
            個人情報とは<br>
            このプライバシー・ポリシーに述べられている「個人情報」とは、お客様の氏名、住所、電話番号、電子メールアドレス、マイナンバーなどはじめとする特定の個人を識別することができる情報をいいます。
          </li>
          <li>
            個人情報の利用目的<br>
            「個人情報」は、以下に記述するような情報の提供、または改善する目的にのみ利用します。
            <ul>
              <li>製品のご検討に関連する情報をお届けするため。</li>
              <li>製品のサポート手続きや確認、サービスを提供するため。</li>
              <li>製品、サービス、セミナーなどの情報をご案内、お届けするため。</li>
              <li>製品、サービス、ウエブサイトなどをよりご満足いただくけるように調査、改良するため</li>
              <li>製品のサポート手続きや確認、サービスを提供するため。</li>
            </ul>
            お客様がこれらの情報の提供をご希望なされない場合は、お申し出いただければ情報の提供は中止いたします。また、上記以外に利用目的を事前に明示した上で得られたお客様の個人情報は、その利用目的以外に使用することはいたしません。
          </li>
          <li>
            第三者への提供<br>
            お客様からご提供いただいた個人情報は、以下のそれぞれの場合を除き、いかなる第三者にも開示または提供することはありません。
            <ul>
              <li>お客様にご承諾頂いた場合。</li>
              <li>法令等により提供を求められた場合。</li>
            </ul>
          </li>
          <li>
            照会・訂正・削除等<br>
            お客様からご提供いただいた個人情報に対しての照会、または正確でない場合の訂正、あるいは削除を希望される場合は、そのご請求がご本人または委任を受けられた方によるものであることが確認できた場合に限り、お問合せ窓口にご請求下されば、合理的な期間内に開示、訂正、削除を致します。
          </li>
          <li>
            安全対策・管理<br>
            ご提供いただきましたお客様の個人情報の紛失、破壊、改ざん、漏洩等の防止に対する合理的かつ適切な安全対策を行っています。お客様の情報への不当なアクセスなどを防止するための措置万全の体制及び個人情報の漏えい、滅失またはき損の防止その他の個人情報の安全管理のために必要かつ適切な措置を整え、個人情報の管理体制に関して継続的に改善に努めてまいります。
          </li>
          <li>
            16歳未満のお客様へのお願い<br>
            16歳未満のお客様が当社に個人情報をご提供する場合は必ず保護者の同意のもとご提供頂きますようお願いいたします。
          </li>
          <li>
            取り組み<br>
            個人情報保護に関して、関連する法令及びその他の規範を遵守致します。<br>
            個人情報保護に関する基本方針及び弊社規程を定め、すべての役員及び社員に周知徹底するとともに、適宜見直しと改善を行ってまいります。
          </li>
          <li>
            プライバシーポリシーの改定<br>
            法令等の変更にあわせて内容の見直しを行い、本プライバシーポリシーの一部を改訂することもあります。
          </li>
        </ol>
      </div>
    </section>
  </div>
</template>

<script lang='ts'>
import { defineComponent } from '@nuxtjs/composition-api'
export default defineComponent({
  head: {
    title: 'Privacy policy',
    meta: [
      // TODO : meta設定
      { name: 'description', content: '株式会社アンヴィルの経営方針です。' }
    ]
  }
})
</script>

<style lang="scss" scoped>
section {
  @apply mb-10;
}

h4 {
  @apply mt-4 sm:mt-8 mb-2 sm:mb-4 text-base sm:text-xl font-semibold;
}

p {
  @apply mb-2 sm:mb-4 leading-6 sm:leading-8 text-sm sm:text-base;
}

ol,
ul {
  @apply mt-2 px-4 text-sm sm:text-base;

  li {
    @apply leading-6 sm:leading-7;
  }
}

ol {
  > li {
    @apply mb-4 sm:mb-8 list-decimal;
  }
}

ul {
  @apply mb-4;

  > li {
    @apply list-disc list-inside;
  }
}
</style>
